package org.appxi.smartlib.util;

public enum Period {
    东汉("东汉", 25, 220),
    曹魏("曹魏", 220, 265),
    吴("吴", 229, 280),
    西晋("西晋", 265, 316),
    晋("晋", 265, 420),
    晋世("晋世", 265, 420),
    东晋("东晋", 317, 420),
    前凉("前凉", 301, 387),
    前秦("前秦", 351, 394),
    符秦("符秦", 351, 394),
    后秦("后秦", 384, 417),
    姚秦("姚秦", 384, 417),
    西秦("西秦", 385, 431),
    乞伏秦("乞伏秦", 385, 431),
    北凉("北凉", 397, 460),
    南北朝("南北朝", 439, 589),
    刘宋("刘宋", 420, 479),
    元魏("元魏", 386, 534),
    北魏("北魏", 386, 534),
    后魏("后魏", 386, 534),
    东魏("东魏", 534, 550),
    萧齐("萧齐", 479, 502),
    南齐("南齐", 479, 502),
    梁("梁", 502, 557),
    萧梁("萧梁", 502, 557),
    北齐("北齐", 550, 577),
    高齐("高齐", 550, 577),
    北周("北周", 557, 581),
    宇文周("宇文周", 557, 581),
    陈("陈", 557, 589),
    隋("隋", 581, 618),
    唐("唐", 618, 907),
    后唐("后唐", 923, 936),
    后晋("后晋", 936, 947),
    石晋("石晋", 936, 947),
    南唐("南唐", 937, 975),
    南汉("南汉", 917, 971),
    后汉("后汉", 947, 951),
    辽("辽", 907, 1125),
    宋("宋", 960, 1279),
    北宋("北宋", 960, 1127),
    南宋("南宋", 1127, 1279),
    唐宋("唐宋", 618, 1279),
    夏("夏", 1032, 1227),
    西夏("西夏", 1032, 1227),
    金("金", 1115, 1234),
    元("元", 1271, 1368),
    明("明", 1368, 1644),
    清("清", 1644, 1911),
    新罗("新罗", -56, 936),
    高丽("高丽", 918, 1392);

    public final String title;
    public final int start, end;

    Period(String title, int start, int end) {
        this.title = title;
        this.start = start;
        this.end = end;
    }

    @Override
    public String toString() {
        return "%s [公元%d～%d年]".formatted(title, start, end);
    }

    public static Period valueBy(String title) {
        for (Period v : values())
            if (v.title.equals(title))
                return v;
        return null;
    }
}
